<script>
    let articles = [
        {
            id: 0,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
        {
            id: 1,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
        {
            id: 2,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
    ]
</script>

<div class="font-bold text-black place-self-start py-4 text-[24px]">
    Подборки
</div>

<div class="flex gap-x-[10px] horscroll max-w-full py-4 h-[330px]">
    {#each articles as article}
        <a
            href="/article/{article.id}"
            class="block text-white rounded-[30px]"
        >
            <div
                class="flex flex-col p-[15px] rounded-[30px] h-[290px] w-[225px]"
                style="background: linear-gradient(180deg, rgba(0, 0, 0, 0.00) 45.83%, #000 100%), url('{new URL(
                    article.img,
                    import.meta.url,
                ) .href}'), lightgray -0.196px -47.204px / 100.174% 116.552% no-repeat;"
            >
                <div class="w-full">
                    <span
                        class="w-24 bg-orange-accent rounded-[20px] px-[14px] py-[7px] font-bold text-[14px]"
                    >
                        подборка
                    </span>
                </div>
                <div class="spacer block h-full" />
                <div class="font-bold text-[20px] leading-[normal]">
                    {article.title}
                </div>
            </div>
        </a>
    {/each}
</div>
