<script lang="ts">
    import "./style.scss"
    import Like from "$lib/components/Like.svelte"
    import commentIcon from "$lib/assets/icons/comment.svg?raw"
    import { page } from "$app/stores"

    let articles = [
        {
            id: 0,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
        {
            id: 1,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
        {
            id: 2,
            title: "Подборка напитков, чтобы согреться зимой",
            hash: ["тепло", "теплые напитки", "зима", "глинтвейн"],
            views: 18,
            img: "/latte.png",
            text: `
            <p>В этой статье будут описаны 10 рецептов зимних напитков, которые можно сделать дома, чтобы согреться в домашнем уюте.</p>
            <h1>1. Имбирно-пряничный латте </h1>
            <p>
                Нам понадобится:
                <ul>
                    <li>2 стакана воды</li>
                    <li>1,5 стакана мелкого сахара</li>
                    <li>2,5 чайной ложки имбиря</li>
                    <li>0,5 чайной ложки молотой корицы</li>
                    <li>0,5 чайной ложки ванилина</li>
                    <li>Маленькая чашка экспрессо</li>
                    <li>Стакан молока</li>
                </ul>
                <p>
                    Все ингредиенты сиропа нужно поместить в небольшую кастрюлю. Помешивая, доведите до кипения, затем уменьшаем огонь, оставляем побулькивать минут 15 и снимаем с плиты.
Латте готовится с применение вспененного молока. Но можно просто подогреть молоко, не доводя его до кипения, а напиток сверху просто украсить взбитыми сливками.
Самый простой способ получить вспененное молоко — это взбить его с помощью блендера. Взбивать молоко нужно в подогретом состоянии. Более жирное молоко даст более густую пену.
В латте соотношение кофе к молоку 1 к 3. В кружку или стакан наливаем кофе, далее четверть получившегося сиропа и потом уже молоко. Перемешайте и можно пить, пока это все не остыло.</p>
                </p>
                <h1>2. Безалкогольный пунш </h1>
                <p>
                    Нам понадобится:
                    <ul>
                        <li>22 апельсина</li>
                        <li>1 яблоко</li>
                        <li>1 лимон</li>
                        <li>100 грамм свежей или замороженной клубники</li>
                        <li>150 грамм сахара</li>
                        <li>1 щепотка корицы</li>
                        <li>1 щепотка кардамона</li>
                        <li>1 щепотка сушеного имбиря</li>
                        <li>400 мл крепкого чая</li>
                    </ul>
                    <p>
                        Все фрукты нужно нарезать ломтиками и вместе с ягодами  переложить в эмалированную или нержавеющую посуду с крышкой.
                        Потом нужно засыпать сахаром и оставить на 30 минут. Затем осторожно перемешать, добавить специи и залить горячим чаем. После этого нужно накрыть посуду крышкой и оставить на 1 час в теплом месте.
                        Когда пройдет час нужно процедить полученный безалкогольный пунш и сразу же разлить по бокалам. 
                    </p> 
                </p>
            </p>

            `,
        },
    ]

    $: article = articles.at(parseInt($page.route.id ?? '0'))!

    const url = new URL(
            (article ?? articles[0] ).img,
            import.meta.url,
        ).href;
</script>

<div class="flex flex-col">
    <div
        class="flex flex-col place-content-end h-[402px] rounded-b-[20px] !bg-cover py-5 px-4 text-white"
        style="background: linear-gradient(180deg, rgba(0, 0, 0, 0.00) 52.08%, rgba(0, 0, 0, 0.60) 90.62%), url('{url}'), lightgray 50% / cover no-repeat;"
    >
        <div class="flex place-content-between">
            {#each article.hash as hash}
                <div class="lowercase font-bold text-[14px] leading-[normal]">
                    #{hash}
                </div>
            {/each}
        </div>
        <div class="text-[24px] font-bold pt-[14px]">
            {article.title}
        </div>
    </div>
    <div class="atext px-5 py-6">
        <!-- <h1>q2</h1> -->
        {@html article.text}
    </div>
    <div
        class="flex place-items-center place-content-start px-5 gap-x-2 pt-8 pb-6"
    >
        <dir class="text-gray place-self-start m-0 p-0">
            {article.views} просмотров
        </dir>
        <dir class="spacer w-full flex-1" />
        <div class="cursor-pointer">
            {@html commentIcon}
        </div>
        <div class="!stroke-[#DBDBDB] cursor-pointer">
            <Like stroke_inherit={true} />
        </div>
    </div>
</div>
